# Combine and Merging Datasets

data contained can be combined together in a number of ways

## Database-Style Dataframe joins


The same key data are bound.
Look at the example

In [4]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

```python
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df1
```

In [24]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

```python
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df2
```

In [21]:
df2 = pd.DataFrame({'key': ['a','b','d'],
                    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

To merge two Dataframe with the same index 
```python
pd.merge(df1,df2)
```

In [23]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

Without setting anything. The key will used from the columns which is the same name in both data frame. The values which are the same in both data are provided, and the Cartesian products of the other values are provided as the data.

It should be better if we specified the key name

```python
pd.merge(df1,df2,on='key')
```

In [25]:
pd.merge(df1,df2 , on = "key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

we can merge on the different column name

```python
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
```

In [26]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

### Work
Form the given /file/studentlist.xlsx
It is the Excel which provide the score of the students.
Create the data frame which consist of the total score of Attendance(Midterm) score,and midterm score
-> to get the new dataframe from the old dataframe column you may use this code
` new = old[['A', 'C', 'D']].copy() `
to change the specific column name you may use
` rankings_pd.rename(columns = {'test':'TEST'}, inplace = True)`
note: you do not have to set the student id column to be the index in this work

In [42]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     -------------------------------------- 250.0/250.0 kB 7.7 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip available: 22.3.1 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [44]:
file_part = r'C:\Users\Wedemmmboyz\LectureNote\08. Data Wrangling\files\studentlist.xlsx'
df = pd.read_excel(r'C:\Users\Wedemmmboyz\LectureNote\08. Data Wrangling\files\studentlist.xlsx')
df

,รายชื่อนักศึกษาที่ลงทะเบียนเรียน ภาคเรียนที่ 1 ปีการศึกษา 2562,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,COURSE NO :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,TITLE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,SECTION (lec/lab) :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,LECTURE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DATE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
36,31,602115520,0.0,8.0,7.0,6.0,6.0,5.0,2.666667
37,32,602115521,10.0,7.0,7.0,6.0,7.0,8.0,3.75
38,33,602115522,10.0,9.0,0.0,6.0,0.0,7.0,2.666667
39,34,602115524,7.0,5.0,6.0,7.0,0.0,6.0,2.583333
40,35,602115526,0.0,0.0,7.0,7.0,7.0,6.0,2.25

Check df3 and df4
```python
df3
```

In [45]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

```python
df4
```

In [46]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

then try to merge df3 and df4
```python
pd.merge(df3,df4)
```

In [48]:
pd.merge(df3,df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

You may see that it's could not merge as there is no column which are the same key name.
We can specify the column name which can be merge using the different name with the `left-on` and `right_on` argument
```python
pd.merge(df3, df4, left_on='lkey', right_on='rkey')
```

In [49]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

or 
```python
pd.merge(df4, df3,  right_on='lkey',left_on='rkey')
```

In [50]:
pd.merge(df4, df3,  right_on='lkey',left_on='rkey')

  rkey  data2 lkey  data1
0    a      0    a      2
1    a      0    a      4
2    a      0    a      5
3    b      1    b      0
4    b      1    b      1
5    b      1    b      6

You may see that c, and d is removed as it's not in the left data frame

To use all data we use the outer argument
```python
pd.merge(df1,df2,how='outer')
```

In [51]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

You may try other argument to see the different
![image-20230915053652812](./assets/image-20230915053652812.png)

inner join is the intersection of the data
```python
pd.merge(df1,df2,how='inner')
```

In [52]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

left join is the left data frame
```python
pd.merge(df1,df2,how='left')
```

In [53]:
pd.merge(df1,df2,how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

we can merge with multiple keys by passing a list of columns
try to create this given data frame
```python
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
```

In [54]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

then try to merge with the multiple keys
```python
pd.merge(left,right,on=['key1','key2'],how='outer')
```

In [55]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

Some time if the name of the column may be collapse. (Same column name, but not the key)
You may change the name of the column before merging directly, or you can set the suffix column
the example of the problem is shown
```python
pd.merge(left, right, on='key1')
```

In [56]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

the suffixes can be set by the `suffixes` argument
```python
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))
```

In [57]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Work
The students have been withdrawn so they do not have the score, in addition the staff change some of the index name.
So please try to add the attendance midterm score to the previous pandas

## Merging by index

Some time you may found that the part you want to merge is the index.
You can set the `left_index=True` or `right_index=True` to indicate that you need to use the index as the merge key

try this source code
```python
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
```

In [60]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

then try to merge with the index
```python
pd.merge(left1, right1, left_on='key', right_index=True)
```

In [61]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

the how can be applied as the same as the normal merge
```python
pd.merge(left1, right1, left_on='key', right_index=True,how ='outer')
```

In [62]:
pd.merge(left1, right1, left_on='key', right_index=True,how ='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

With hierarchically index, joining on index can be used as multiple-key merge
```python
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                        index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                                'Ohio', 'Ohio'],
                                 [2001, 2000, 2000, 2000, 2001, 2002]],
                        columns=['event1', 'event2'])
 ```

In [63]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                        index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                                'Ohio', 'Ohio'],
                                 [2001, 2000, 2000, 2000, 2001, 2002]],
                        columns=['event1', 'event2'])

The merge with multiple column can be set with the column, and the key index
```python
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)
```

In [64]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

with the `outer` join all data will be merged
```python
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')
```

In [65]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

### Work
now setting the index to the Dataframe which we have done so far.
then add the rest of the score so that we can handle the overall score with in Dataframe

In [1]:
import pandas as pd

In [3]:
df = pd.read_excel(r"C:\Users\Wedemmmboyz\LectureNote\08. Data Wrangling\files\studentlist.xlsx")
df

,รายชื่อนักศึกษาที่ลงทะเบียนเรียน ภาคเรียนที่ 1 ปีการศึกษา 2562,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,COURSE NO :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,TITLE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,SECTION (lec/lab) :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,LECTURE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DATE :,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,ที่,รหัสนักศึกษา,2.0,3.0,4.0,5.0,6.0,7.0,Total (5)
6,1,582115509,5.0,5.0,5.0,5.0,5.0,5.0,2.5
7,2,592115508,5.0,5.0,5.0,5.0,5.0,5.0,2.5
8,3,592115521,5.0,5.0,5.0,5.0,5.0,5.0,2.5
9,4,602115001,0.0,0.0,0.0,0.0,0.0,0.0,0
10,5,602115002,9.0,8.0,7.0,9.0,7.0,8.0,4
11,6,602115003,0.0,0.0,0.0,8.0,0.0,0.0,0.666667
12,7,602115004,0.0,6.0,0.0,8.0,7.0,6.0,2.25
13,8,602115005,7.0,6.0,6.0,5.0,0.0,6.0,2.5
14,9,602115006,6.0,0.0,6.0,0.0,0.0,7.0,1.583333
15,10,602115008,0.0,0.0,0.0,5.0,0.0,6.0,0.916667
16,11,602115009,7.0,6.0,6.0,0.0,0.0,5.0,2
17,12,602115011,0.0,5.0,0.0,6.0,8.0,7.0,2.166667
18,13,602115012,0.0,0.0,9.0,0.0,10.0,9.0,2.333333
19,14,602115017,0.0,7.0,7.0,7.0,7.0,8.0,3
20,15,602115018,0.0,0.0,6.0,0.0,0.0,0.0,0.5
21,16,602115020,0.0,0.0,6.0,0.0,0.0,6.0,1
22,17,602115023,10.0,8.0,7.0,8.0,9.0,8.0,4.166667
23,18,602115024,9.0,0.0,6.0,7.0,9.0,7.0,3.166667
24,19,602115025,10.0,8.0,9.0,7.0,9.0,7.0,4.166667
25,20,602115503,9.0,5.0,8.0,6.0,7.0,6.0,3.416667
26,21,602115504,0.0,0.0,0.0,0.0,8.0,8.0,1.333333
27,22,602115505,0.0,5.0,5.0,7.0,6.0,7.0,2.5
28,23,602115507,0.0,7.0,8.0,7.0,7.0,0.0,2.416667
29,24,602115508,7.0,6.0,6.0,6.0,0.0,7.0,2.666667
30,25,602115509,5.0,7.0,7.0,5.0,0.0,5.0,2.416667
31,26,602115512,0.0,5.0,0.0,5.0,0.0,0.0,0.833333
32,27,602115515,0.0,0.0,6.0,0.0,7.0,0.0,1.083333
33,28,602115516,0.0,8.0,8.0,0.0,0.0,0.0,1.333333
34,29,602115517,9.0,9.0,0.0,6.0,0.0,7.0,2.583333
35,30,602115519,10.0,6.0,8.0,6.0,7.0,7.0,3.666667
36,31,602115520,0.0,8.0,7.0,6.0,6.0,5.0,2.666667
37,32,602115521,10.0,7.0,7.0,6.0,7.0,8.0,3.75
38,33,602115522,10.0,9.0,0.0,6.0,0.0,7.0,2.666667
39,34,602115524,7.0,5.0,6.0,7.0,0.0,6.0,2.583333
40,35,602115526,0.0,0.0,7.0,7.0,7.0,6.0,2.25

Now find the name of the students whose name is in the top 10 of the total score.

In [4]:
# Filtering out the actual student data and renaming columns for ease of use
students_df = df.iloc[6:].copy()
students_df.columns = ['No', 'Student_ID', 'Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5', 'Score_6', 'Total_Score']

# Converting the 'Total_Score' column to numeric
students_df['Total_Score'] = pd.to_numeric(students_df['Total_Score'], errors='coerce')

# Sorting the data by 'Total_Score' in descending order and getting top 10 students
top_10_students = students_df.nlargest(10, 'Total_Score')[['Student_ID', 'Total_Score']]

top_10_students

   Student_ID  Total_Score
22  602115023     4.166667
24  602115025     4.166667
10  602115002     4.000000
37  602115521     3.750000
35  602115519     3.666667
25  602115503     3.416667
23  602115024     3.166667
19  602115017     3.000000
29  602115508     2.666667
36  602115520     2.666667

## Concatenating Along an Axis

Concatenating data is to concat data to the same data.

An Axis mean concat the column data

In NumPy concatenate data concate it in each columns as shown in example

```python
arr = np.arange(12).reshape((3, 4))
arr
```

In [66]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

We can concat the arrays by using the `np.concatenate` function
```python
np.concatenate([arr, arr])
```

In [67]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

we can concatenate the array in the different axis by passing the axis argument
```python
np.concatenate([arr, arr], axis=1)
```

In [68]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In Pandas, there are many concerns before concatination

* If the objects are indexed differently on the other axes, should we combine the distinct elements in these axes or use only the shared values (the intersection)?
* Do the concatenated chunks of data need to be identifiable in the resulting object?
* Does the “concatenation axis” contain data that needs to be preserved? In many cases, the default integer labels in a DataFrame are best discarded during concatenation.

try creating a series

```python
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])
```

In [69]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

Then try the simple concat
```python
pd.concat([s1, s2, s3])
```

In [70]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

and then concat on Axis
```python
pd.concat([s1, s2, s3], axis=1)
```

In [71]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

You may name each of the columns by the key column
```python
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])
```

In [72]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

You may notice that each series are concat as a new column.

This we can say as the union case as the data that combined all data (and NaN has been added to complete the data series)

To intersect them, you may passing `join='inner'`

see the following example
```python
s4 = pd.concat([s1, s3])
s4
```

In [73]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

if we concat in the different axis
```python
pd.concat([s1, s4], axis=1)
```

In [74]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [75]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

then try the inner join
```python
pd.concat([s1, s4], axis=1, join='inner')
```

In [7]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

NameError: name 's1' is not defined

we can provide the hierarchical index of the search as given
```python
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result
```

In [6]:
result.unstack()

NameError: name 'result' is not defined

we also use the unstack() to show all data
```python
result.unstack()
```

In [5]:
result.unstack()

NameError: name 'result' is not defined

### Work
It's happen that there are other sections score in the class. The files/studentlist2.xlsx provide the score for the second section. merge the data from two file to only one dataframe to find out the descriptive statistic of all the students.

In [8]:
# Load the scores from the second Excel file into a pandas DataFrame
df2 = pd.read_excel(r'C:\Users\Wedemmmboyz\LectureNote\08. Data Wrangling\files\studentlist2.xlsx')

# Filter out the actual student data and rename columns for ease of use
students_df2 = df2.iloc[6:].copy()
students_df2.columns = ['No', 'Student_ID', 'Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5', 'Score_6', 'Total_Score']

# Convert the 'Total_Score' column to numeric
students_df2['Total_Score'] = pd.to_numeric(students_df2['Total_Score'], errors='coerce')

# Display the first few rows of the new dataframe to check the data
students_df2.head()

,No,Student_ID,Score_1,Score_2,Score_3,Score_4,Score_5,Score_6,Total_Score
6,1,612115509,5.0,5.0,5.0,5.0,5.0,5.0,2
7,2,612115508,5.0,5.0,5.0,5.0,5.0,5.0,2

In [9]:
# Merging the two dataframes on 'Student_ID' and summing the scores for each student
merged_df = pd.concat([students_df, students_df2]).groupby('Student_ID').sum().reset_index()

# Calculating the descriptive statistics for all students
descriptive_stats = merged_df['Total_Score'].describe()

descriptive_stats

count    37.000000
mean      2.272523
std       1.029962
min       0.000000
25%       1.583333
50%       2.416667
75%       2.666667
max       4.166667
Name: Total_Score, dtype: float64

In [10]:
import numpy as np

# Creating a new DataFrame with random scores
np.random.seed(42)  # for reproducibility
max_score = descriptive_stats['max']
random_scores = pd.DataFrame({
    'Student_ID': merged_df['Student_ID'],
    'Random_Score': np.random.randint(1, int(max_score) + 1, size=merged_df.shape[0])
})

# Merging random scores with the student scores
merged_df = merged_df.merge(random_scores, on='Student_ID')

# Calculating the new total score for each student
merged_df['New_Total_Score'] = merged_df['Total_Score'] + merged_df['Random_Score']

# Assigning grades based on the new total score
merged_df['Grade'] = np.where(merged_df['New_Total_Score'] < 80, 'F', 'A')

# Displaying the updated dataframe with random scores, new total scores, and grades
merged_df[['Student_ID', 'Random_Score', 'New_Total_Score', 'Grade']]

    Student_ID  Random_Score  New_Total_Score Grade
0    582115509             3         5.500000     F
1    592115508             4         6.500000     F
2    592115521             1         3.500000     F
3    602115001             3         3.000000     F
4    602115002             3         7.000000     F
5    602115003             4         4.666667     F
6    602115004             1         3.250000     F
7    602115005             1         3.500000     F
8    602115006             3         4.583333     F
9    602115008             2         2.916667     F
10   602115009             3         5.000000     F
11   602115011             3         5.166667     F
12   602115012             3         5.333333     F
13   602115017             3         6.000000     F
14   602115018             4         4.500000     F
15   602115020             1         2.000000     F
16   602115023             4         8.166667     F
17   602115024             4         7.166667     F
18   602115025             4         8.166667     F
19   602115503             3         6.416667     F
20   602115504             2         3.333333     F
21   602115505             1         3.500000     F
22   602115507             2         4.416667     F
23   602115508             4         6.666667     F
24   602115509             4         6.416667     F
25   602115512             2         2.833333     F
26   602115515             2         3.083333     F
27   602115516             2         3.333333     F
28   602115517             4         6.583333     F
29   602115519             4         7.666667     F
30   602115520             1         3.666667     F
31   602115521             1         4.750000     F
32   602115522             4         6.666667     F
33   602115524             2         4.583333     F
34   602115526             2         4.250000     F
35   612115508             1         3.000000     F
36   612115509             4         6.000000     F

The teacher is very funny, they will random the score for all the students, create a new dataframe which provide the random score from 1 to the maximum score we can get from all students.
then merge the score to the student, and calculate the new score of all the student. then set the grade of the student by who get the grade less than 80 will get `F` otherwise will get `A`

## Combine Data with Overlap



The data con be merse if there are overlap in full or part

In [81]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

Combine the series using the if else expression.
Let's try
```python
np.where(pd.isnull(a),b,a)
```

In [82]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

In [11]:
np.where(pd.isnull(a),a,b)

NameError: name 'a' is not defined

try vice versa
```python
np.where(pd.isnull(a),a,b)
```

In [83]:
np.where(pd.isnull(a),a,b)

array([nan,  1., nan,  3.,  4., nan])

`combine_first` combine the data the series
```python
b[:-2].combine_first(a[2:])
```

In [84]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

`combine_first` for the Dataframe will do the same thing but with all column by column.

It is similar to *patching* the data (replace the data in `NaN` position.

In [85]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
 'b': [np.nan, 2., np.nan, 6.],
 'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
 'b': [np.nan, 3., 4., 6., 8.]})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [86]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

try
```python
df1.combine_first(df2)
```

In [87]:
df2.combine_first(df1)

     a    b     c
0  5.0  NaN   2.0
1  4.0  3.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

```python
df2.combine_first(df1)
```

# Reshaping and Pivoting

## Reshaping with Hierachical Indexing

Using the Hierarchical Indexing can reshape data in different way

The operations we can use are



*   `stack` rotate or pivots from the columns in the data to the rows
*   `unstack` privots from the rows into the columns

In [88]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
    index=pd.Index(['Ohio', 'Colorado'], name='state'),
    columns=pd.Index(['one', 'two', 'three'],
    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

Using the `stack` to pivot the columns into the rows, produce a serie from the data frame

```python
result = data.stack()
result
```

In [89]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

from hierachically indexed Series, we can rearrange into a DataFrame with `unstack`
```python
result.unstack()
```

In [90]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

By the default the innermost level is unstacked, we can unstadck the different level by pasing the level name.
```python
result.unstack('state')
```

In [91]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

unstack may introduce the missing data if all of the value in the level is ont found in each group

In [92]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

try to do unstack
```python
data2.unstack()
```

In [93]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

Stacking filter out the missing data by default, to preseved the na when unstack `dropna=False ` is required
```python
data2.unstack().stack()
```

In [94]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

when using the dropna
```python
data2.unstack().stack(dropna=False)
```

In [95]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

When you unstack in a DataFrame, the **level unstacked** becomes the lowest level in the result
```python
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df
```

In [97]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

try
```python
df.unstack('state')
```

In [98]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

we may use the state to stack the side
```python
df.unstack('state').stack('side')
```

In [99]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

# Work

From the three files provided [here](https://github.com/jakevdp/data-USstates/)

1. Bind all data to get the data frame which have the state/ abbreviation, and area(sq.mi)
2. Bind the data to get the State, age, and population
3. Create the multiple hierachy dataframe, which contains the age as sub hierachy. The column should be the year and population, and the year must be order.

In [12]:
# Loading the data from each file into pandas DataFrames
state_population = pd.read_csv(r"C:\Users\Wedemmmboyz\Downloads\state-population.csv")
state_areas = pd.read_csv(r"C:\Users\Wedemmmboyz\Downloads\state-areas.csv")
state_abbrevs = pd.read_csv(r"C:\Users\Wedemmmboyz\Downloads\state-abbrevs.csv")

# Displaying the first few rows of each dataframe to understand its structure
state_population.head(), state_areas.head(), state_abbrevs.head()

(  state/region     ages  year  population
 0           AL  under18  2012   1117489.0
 1           AL    total  2012   4817528.0
 2           AL  under18  2010   1130966.0
 3           AL    total  2010   4785570.0
 4           AL  under18  2011   1125763.0,
         state  area (sq. mi)
 0     Alabama          52423
 1      Alaska         656425
 2     Arizona         114006
 3    Arkansas          53182
 4  California         163707,
         state abbreviation
 0     Alabama           AL
 1      Alaska           AK
 2     Arizona           AZ
 3    Arkansas           AR
 4  California           CA)

1. Bind all data to get the data frame which have the state/ abbreviation, and area(sq.mi)

In [13]:
# Merging state_areas and state_abbrevs on the "state" column
state_area_abbrev = pd.merge(state_areas, state_abbrevs, on='state')

# Displaying the merged dataframe
state_area_abbrev.head()

        state  area (sq. mi) abbreviation
0     Alabama          52423           AL
1      Alaska         656425           AK
2     Arizona         114006           AZ
3    Arkansas          53182           AR
4  California         163707           CA

2. Bind the data to get the State, age, and population

In [14]:
# Merging state_population and state_abbrevs on the abbreviation column
state_age_population = pd.merge(state_population, state_abbrevs, left_on='state/region', right_on='abbreviation')

# Dropping redundant columns
state_age_population = state_age_population[['state', 'ages', 'year', 'population']]

# Displaying the merged dataframe
state_age_population.head()

     state     ages  year  population
0  Alabama  under18  2012   1117489.0
1  Alabama    total  2012   4817528.0
2  Alabama  under18  2010   1130966.0
3  Alabama    total  2010   4785570.0
4  Alabama  under18  2011   1125763.0

3. Create the multiple hierachy dataframe, which contains the age as sub hierachy. The column should be the year and population, and the year must be order.

In [15]:
# Creating a multi-hierarchy dataframe with "state" and "ages" as indices
multi_hier_df = state_age_population.pivot_table(values='population', index=['state', 'ages'], columns='year').sort_index(axis=1)

# Displaying the multi-hierarchy dataframe
multi_hier_df.head()

year                  1990       1991       1992       1993       1994  \
state   ages
Alabama total    4050055.0  4099156.0  4154014.0  4214202.0  4260229.0
        under18  1050041.0  1060794.0  1072873.0  1085606.0  1097180.0
Alaska  total     553290.0   570193.0   588736.0   599434.0   603308.0
        under18   177502.0   182180.0   184878.0   187190.0   187439.0
Arizona total    3684097.0  3788576.0  3915740.0  4065440.0  4245089.0

year                  1995       1996       1997       1998       1999  ...  \
state   ages                                                            ...
Alabama total    4296800.0  4331103.0  4367935.0  4404701.0  4430141.0  ...
        under18  1110553.0  1112092.0  1122893.0  1118252.0  1121287.0  ...
Alaska  total     604412.0   608569.0   612968.0   619933.0   624779.0  ...
        under18   184990.0   185360.0   188280.0   192636.0   191422.0  ...
Arizona total    4432499.0  4586940.0  4736990.0  4883342.0  5023823.0  ...

year                  2004       2005       2006       2007       2008  \
state   ages
Alabama total    4530729.0  4569805.0  4628981.0  4672840.0  4718206.0
        under18  1113662.0  1117229.0  1126798.0  1132296.0  1134927.0
Alaska  total     659286.0   666946.0   675302.0   680300.0   687455.0
        under18   186335.0   185304.0   185580.0   184344.0   183124.0
Arizona total    5652404.0  5839077.0  6029141.0  6167681.0  6280362.0

year                  2009       2010       2011       2012       2013
state   ages
Alabama total    4757938.0  4785570.0  4801627.0  4817528.0  4833722.0
        under18  1134192.0  1130966.0  1125763.0  1117489.0  1111481.0
Alaska  total     698895.0   713868.0   723375.0   730307.0   735132.0
        under18   186351.0   187902.0   188329.0   188162.0   188132.0
Arizona total    6343154.0  6408790.0  6468796.0  6551149.0  6626624.0

[5 rows x 24 columns]